hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_power.h
/**
    Copyright (c) 2017 - 2018, Nordic Semiconductor ASA

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification,
    are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
      list of conditions and the following disclaimer.

    2. Redistributions in binary form, except as embedded into a Nordic
      Semiconductor ASA integrated circuit in a product or a software update for
      such product, must reproduce the above copyright notice, this list of
      conditions and the following disclaimer in the documentation and/or other
      materials provided with the distribution.

    3. Neither the name of Nordic Semiconductor ASA nor the names of its
      contributors may be used to endorse or promote products derived from this
      software without specific prior written permission.

    4. This software, with or without modification, must only be used with a
      Nordic Semiconductor ASA integrated circuit.

    5. Any software provided in binary form under this license must not be reverse
      engineered, decompiled, modified and/or disassembled.

    THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
    OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
    OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
    LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
    CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
    GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
    HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
    LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
    OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF_POWER_H__
#define NRF_POWER_H__

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

/**
    @defgroup nrf_power_hal POWER HAL
    @{
    @ingroup nrf_power
    @brief   Hardware access layer for managing the POWER peripheral.
*/

#if defined(POWER_RAMSTATUS_RAMBLOCK0_Msk)
#define NRF_POWER_HAS_RAMSTATUS 1
#else
#define NRF_POWER_HAS_RAMSTATUS 0
#endif

/**
    @name The implemented functionality
    @{

    Macros that defines functionality that is implemented into POWER peripheral.
*/
#if defined(POWER_INTENSET_SLEEPENTER_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief The fact that sleep events are present

    In some MCUs there is possibility to process sleep entering and exiting
    events.
*/
#define NRF_POWER_HAS_SLEEPEVT 1
#else
#define NRF_POWER_HAS_SLEEPEVT 0
#endif

#if defined(POWER_RAM_POWER_S0POWER_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief The fact that RAMPOWER registers are present

    After nRF51, new way to manage RAM power was implemented.
    Special registers, one for every RAM block that makes it possible to
    power ON or OFF RAM segments and turn ON and OFF RAM retention in system OFF
    state.
*/
#define NRF_POWER_HAS_RAMPOWER_REGS 1
#else
#define NRF_POWER_HAS_RAMPOWER_REGS 0
#endif

#if defined(POWER_POFCON_THRESHOLDVDDH_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Auxiliary definition to mark the fact that VDDH is present

    This definition can be used in a code to decide if the part with VDDH
    related settings should be implemented.
*/
#define NRF_POWER_HAS_VDDH 1
#else
#define NRF_POWER_HAS_VDDH 0
#endif

#if defined(POWER_USBREGSTATUS_VBUSDETECT_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief The fact that power module manages USB regulator

    In devices that have USB, power peripheral manages also connection
    detection and USB power regulator, that converts 5&nbsp;V to 3.3&nbsp;V
    used by USBD peripheral.
*/
#define NRF_POWER_HAS_USBREG 1
#else
#define NRF_POWER_HAS_USBREG 0
#endif
/** @} */

/*  ------------------------------------------------------------------------------------------------
    Begin of automatically generated part
    ------------------------------------------------------------------------------------------------
*/

/**
    @brief POWER tasks
*/
typedef enum /*lint -save -e30 -esym(628,__INTADDR__) */
{
    NRF_POWER_TASK_CONSTLAT  = offsetof(NRF_POWER_Type, TASKS_CONSTLAT), /**< Enable constant latency mode */
    NRF_POWER_TASK_LOWPWR    = offsetof(NRF_POWER_Type, TASKS_LOWPWR),   /**< Enable low power mode (variable latency) */
} nrf_power_task_t; /*lint -restore */

/**
    @brief POWER events
*/
typedef enum /*lint -save -e30 -esym(628,__INTADDR__) */
{
    NRF_POWER_EVENT_POFWARN      = offsetof(NRF_POWER_Type, EVENTS_POFWARN),     /**< Power failure warning */
    #if NRF_POWER_HAS_SLEEPEVT
    NRF_POWER_EVENT_SLEEPENTER   = offsetof(NRF_POWER_Type, EVENTS_SLEEPENTER),  /**< CPU entered WFI/WFE sleep */
    NRF_POWER_EVENT_SLEEPEXIT    = offsetof(NRF_POWER_Type, EVENTS_SLEEPEXIT),   /**< CPU exited WFI/WFE sleep */
    #endif
    #if NRF_POWER_HAS_USBREG
    NRF_POWER_EVENT_USBDETECTED  = offsetof(NRF_POWER_Type, EVENTS_USBDETECTED), /**< Voltage supply detected on VBUS */
    NRF_POWER_EVENT_USBREMOVED   = offsetof(NRF_POWER_Type, EVENTS_USBREMOVED),  /**< Voltage supply removed from VBUS */
    NRF_POWER_EVENT_USBPWRRDY    = offsetof(NRF_POWER_Type, EVENTS_USBPWRRDY),   /**< USB 3.3&nbsp;V supply ready */
    #endif
} nrf_power_event_t; /*lint -restore */

/**
    @brief POWER interrupts
*/
typedef enum
{
    NRF_POWER_INT_POFWARN_MASK     = POWER_INTENSET_POFWARN_Msk,     /**< Write '1' to Enable interrupt for POFWARN event */
    #if NRF_POWER_HAS_SLEEPEVT
    NRF_POWER_INT_SLEEPENTER_MASK  = POWER_INTENSET_SLEEPENTER_Msk,  /**< Write '1' to Enable interrupt for SLEEPENTER event */
    NRF_POWER_INT_SLEEPEXIT_MASK   = POWER_INTENSET_SLEEPEXIT_Msk,   /**< Write '1' to Enable interrupt for SLEEPEXIT event */
    #endif
    #if NRF_POWER_HAS_USBREG
    NRF_POWER_INT_USBDETECTED_MASK = POWER_INTENSET_USBDETECTED_Msk, /**< Write '1' to Enable interrupt for USBDETECTED event */
    NRF_POWER_INT_USBREMOVED_MASK  = POWER_INTENSET_USBREMOVED_Msk,  /**< Write '1' to Enable interrupt for USBREMOVED event */
    NRF_POWER_INT_USBPWRRDY_MASK   = POWER_INTENSET_USBPWRRDY_Msk,   /**< Write '1' to Enable interrupt for USBPWRRDY event */
    #endif
} nrf_power_int_mask_t;

/**
    @brief Function for activating a specific POWER task.

    @param task Task.
*/
__STATIC_INLINE void nrf_power_task_trigger(nrf_power_task_t task);

/**
    @brief Function for returning the address of a specific POWER task register.

    @param task Task.

    @return Task address.
*/
__STATIC_INLINE uint32_t nrf_power_task_address_get(nrf_power_task_t task);

/**
    @brief Function for clearing a specific event.

    @param event Event.
*/
__STATIC_INLINE void nrf_power_event_clear(nrf_power_event_t event);

/**
    @brief Function for returning the state of a specific event.

    @param event Event.

    @retval true If the event is set.
    @retval false If the event is not set.
*/
__STATIC_INLINE bool nrf_power_event_check(nrf_power_event_t event);

/**
    @brief Function for getting and clearing the state of specific event

    This function checks the state of the event and clears it.

    @param event Event.

