hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_power.h
    @retval true If the event was set.
    @retval false If the event was not set.
*/
__STATIC_INLINE bool nrf_power_event_get_and_clear(nrf_power_event_t event);

/**
    @brief Function for returning the address of a specific POWER event register.

    @param     event  Event.

    @return Address.
*/
__STATIC_INLINE uint32_t nrf_power_event_address_get(nrf_power_event_t event);

/**
    @brief Function for enabling selected interrupts.

    @param     int_mask Interrupts mask.
*/
__STATIC_INLINE void nrf_power_int_enable(uint32_t int_mask);

/**
    @brief Function for retrieving the state of selected interrupts.

    @param     int_mask Interrupts mask.

    @retval true If any of selected interrupts is enabled.
    @retval false If none of selected interrupts is enabled.
*/
__STATIC_INLINE bool nrf_power_int_enable_check(uint32_t int_mask);

/**
    @brief Function for retrieving the information about enabled interrupts.

    @return The flags of enabled interrupts.
*/
__STATIC_INLINE uint32_t nrf_power_int_enable_get(void);

/**
    @brief Function for disabling selected interrupts.

    @param     int_mask Interrupts mask.
*/
__STATIC_INLINE void nrf_power_int_disable(uint32_t int_mask);


/** @} */ /*  End of nrf_power_hal */


#ifndef SUPPRESS_INLINE_IMPLEMENTATION

/*  ------------------------------------------------------------------------------------------------
    Internal functions
*/

/**
    @internal
    @brief Internal function for getting task/event register address

    @oaram offset Offset of the register from the instance beginning

    @attention offset has to be modulo 4 value. In other case we can get hardware fault.
    @return Pointer to the register
*/
__STATIC_INLINE volatile uint32_t *nrf_power_regptr_get(uint32_t offset)
{
    return (volatile uint32_t *)(((uint8_t *)NRF_POWER) + (uint32_t)offset);
}

/**
    @internal
    @brief Internal function for getting task/event register address - constant version

    @oaram offset Offset of the register from the instance beginning

    @attention offset has to be modulo 4 value. In other case we can get hardware fault.
    @return Pointer to the register
*/
__STATIC_INLINE volatile const uint32_t *nrf_power_regptr_get_c(
    uint32_t offset)
{
    return (volatile const uint32_t *)(((uint8_t *)NRF_POWER) +
                                       (uint32_t)offset);
}

/*  ------------------------------------------------------------------------------------------------
    Interface functions definitions
*/

void nrf_power_task_trigger(nrf_power_task_t task)
{
    *(nrf_power_regptr_get((uint32_t)task)) = 1UL;
}

uint32_t nrf_power_task_address_get(nrf_power_task_t task)
{
    return (uint32_t)nrf_power_regptr_get_c((uint32_t)task);
}

void nrf_power_event_clear(nrf_power_event_t event)
{
    *(nrf_power_regptr_get((uint32_t)event)) = 0UL;
}

bool nrf_power_event_check(nrf_power_event_t event)
{
    return (bool) * nrf_power_regptr_get_c((uint32_t)event);
}

bool nrf_power_event_get_and_clear(nrf_power_event_t event)
{
    bool ret = nrf_power_event_check(event);
    
    if(ret)
        nrf_power_event_clear(event);
        
    return ret;
}

uint32_t nrf_power_event_address_get(nrf_power_event_t event)
{
    return (uint32_t)nrf_power_regptr_get_c((uint32_t)event);
}

void nrf_power_int_enable(uint32_t int_mask)
{
    NRF_POWER->INTENSET = int_mask;
}

bool nrf_power_int_enable_check(uint32_t int_mask)
{
    return !!(NRF_POWER->INTENSET & int_mask);
}

uint32_t nrf_power_int_enable_get(void)
{
    return NRF_POWER->INTENSET;
}

void nrf_power_int_disable(uint32_t int_mask)
{
    NRF_POWER->INTENCLR = int_mask;
}

#endif /* SUPPRESS_INLINE_IMPLEMENTATION */

/*  ------------------------------------------------------------------------------------------------
    End of automatically generated part
    ------------------------------------------------------------------------------------------------
*/
/**
    @ingroup nrf_power_hal
    @{
*/

/**
    @brief Reset reason
*/
typedef enum
{
    NRF_POWER_RESETREAS_RESETPIN_MASK = POWER_RESETREAS_RESETPIN_Msk, /*!< Bit mask of RESETPIN field. *///!< NRF_POWER_RESETREAS_RESETPIN_MASK
    NRF_POWER_RESETREAS_DOG_MASK      = POWER_RESETREAS_DOG_Msk,      /*!< Bit mask of DOG field. */          //!< NRF_POWER_RESETREAS_DOG_MASK
    NRF_POWER_RESETREAS_SREQ_MASK     = POWER_RESETREAS_SREQ_Msk,     /*!< Bit mask of SREQ field. */        //!< NRF_POWER_RESETREAS_SREQ_MASK
    NRF_POWER_RESETREAS_LOCKUP_MASK   = POWER_RESETREAS_LOCKUP_Msk,   /*!< Bit mask of LOCKUP field. */    //!< NRF_POWER_RESETREAS_LOCKUP_MASK
    NRF_POWER_RESETREAS_OFF_MASK      = POWER_RESETREAS_OFF_Msk,      /*!< Bit mask of OFF field. */          //!< NRF_POWER_RESETREAS_OFF_MASK
    #if defined(POWER_RESETREAS_LPCOMP_Msk) || defined(__NRFX_DOXYGEN__)
    NRF_POWER_RESETREAS_LPCOMP_MASK   = POWER_RESETREAS_LPCOMP_Msk,   /*!< Bit mask of LPCOMP field. */    //!< NRF_POWER_RESETREAS_LPCOMP_MASK
    #endif
    NRF_POWER_RESETREAS_DIF_MASK      = POWER_RESETREAS_DIF_Msk,      /*!< Bit mask of DIF field. */          //!< NRF_POWER_RESETREAS_DIF_MASK
    #if defined(POWER_RESETREAS_NFC_Msk) || defined(__NRFX_DOXYGEN__)
    NRF_POWER_RESETREAS_NFC_MASK      = POWER_RESETREAS_NFC_Msk,      /*!< Bit mask of NFC field. */
    #endif
    #if defined(POWER_RESETREAS_VBUS_Msk) || defined(__NRFX_DOXYGEN__)
    NRF_POWER_RESETREAS_VBUS_MASK     = POWER_RESETREAS_VBUS_Msk,     /*!< Bit mask of VBUS field. */
    #endif
} nrf_power_resetreas_mask_t;

#if NRF_POWER_HAS_USBREG
/**
    @brief USBREGSTATUS register bit masks

    @sa nrf_power_usbregstatus_get
*/
typedef enum
{
    NRF_POWER_USBREGSTATUS_VBUSDETECT_MASK = POWER_USBREGSTATUS_VBUSDETECT_Msk, /**< USB detected or removed     */
    NRF_POWER_USBREGSTATUS_OUTPUTRDY_MASK  = POWER_USBREGSTATUS_OUTPUTRDY_Msk   /**< USB 3.3&nbsp;V supply ready */
} nrf_power_usbregstatus_mask_t;
#endif

#if NRF_POWER_HAS_RAMSTATUS
/**
    @brief RAM blocks numbers

    @sa nrf_power_ramblock_mask_t
    @note
    Ram blocks has to been used in nrf51.
    In new CPU ram is divided into segments and this functionality is depreciated.
    For the newer MCU see the PS for mapping between internal RAM and RAM blocks,
    because this mapping is not 1:1, and functions related to old style blocks
    should not be used.
*/
typedef enum
{
    NRF_POWER_RAMBLOCK0 = POWER_RAMSTATUS_RAMBLOCK0_Pos,
    NRF_POWER_RAMBLOCK1 = POWER_RAMSTATUS_RAMBLOCK1_Pos,
    NRF_POWER_RAMBLOCK2 = POWER_RAMSTATUS_RAMBLOCK2_Pos,
    NRF_POWER_RAMBLOCK3 = POWER_RAMSTATUS_RAMBLOCK3_Pos
} nrf_power_ramblock_t;

/**
    @brief RAM blocks masks

    @sa nrf_power_ramblock_t
*/
typedef enum
{
    NRF_POWER_RAMBLOCK0_MASK = POWER_RAMSTATUS_RAMBLOCK0_Msk,
    NRF_POWER_RAMBLOCK1_MASK = POWER_RAMSTATUS_RAMBLOCK1_Msk,
    NRF_POWER_RAMBLOCK2_MASK = POWER_RAMSTATUS_RAMBLOCK2_Msk,
    NRF_POWER_RAMBLOCK3_MASK = POWER_RAMSTATUS_RAMBLOCK3_Msk
} nrf_power_ramblock_mask_t;
#endif // NRF_POWER_HAS_RAMSTATUS

/**
    @brief RAM power state position of the bits

