hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_power.h
    All possible bits described, even if they are not used in selected MCU.
*/
typedef enum
{
    NRF_POWER_RAMPOWER_S0POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S0POWER,
    NRF_POWER_RAMPOWER_S1POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S1POWER,
    NRF_POWER_RAMPOWER_S2POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S2POWER,
    NRF_POWER_RAMPOWER_S3POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S3POWER,
    NRF_POWER_RAMPOWER_S4POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S4POWER,
    NRF_POWER_RAMPOWER_S5POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S5POWER,
    NRF_POWER_RAMPOWER_S7POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S7POWER,
    NRF_POWER_RAMPOWER_S8POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S8POWER,
    NRF_POWER_RAMPOWER_S9POWER_MASK  = 1UL << NRF_POWER_RAMPOWER_S9POWER,
    NRF_POWER_RAMPOWER_S10POWER_MASK = 1UL << NRF_POWER_RAMPOWER_S10POWER,
    NRF_POWER_RAMPOWER_S11POWER_MASK = 1UL << NRF_POWER_RAMPOWER_S11POWER,
    NRF_POWER_RAMPOWER_S12POWER_MASK = 1UL << NRF_POWER_RAMPOWER_S12POWER,
    NRF_POWER_RAMPOWER_S13POWER_MASK = 1UL << NRF_POWER_RAMPOWER_S13POWER,
    NRF_POWER_RAMPOWER_S14POWER_MASK = 1UL << NRF_POWER_RAMPOWER_S14POWER,
    NRF_POWER_RAMPOWER_S15POWER_MASK = 1UL << NRF_POWER_RAMPOWER_S15POWER,
    
    NRF_POWER_RAMPOWER_S0RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S0RETENTION,
    NRF_POWER_RAMPOWER_S1RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S1RETENTION,
    NRF_POWER_RAMPOWER_S2RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S2RETENTION,
    NRF_POWER_RAMPOWER_S3RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S3RETENTION,
    NRF_POWER_RAMPOWER_S4RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S4RETENTION,
    NRF_POWER_RAMPOWER_S5RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S5RETENTION,
    NRF_POWER_RAMPOWER_S7RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S7RETENTION,
    NRF_POWER_RAMPOWER_S8RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S8RETENTION,
    NRF_POWER_RAMPOWER_S9RETENTION_MASK  = 1UL << NRF_POWER_RAMPOWER_S9RETENTION,
    NRF_POWER_RAMPOWER_S10RETENTION_MASK = 1UL << NRF_POWER_RAMPOWER_S10RETENTION,
    NRF_POWER_RAMPOWER_S11RETENTION_MASK = 1UL << NRF_POWER_RAMPOWER_S11RETENTION,
    NRF_POWER_RAMPOWER_S12RETENTION_MASK = 1UL << NRF_POWER_RAMPOWER_S12RETENTION,
    NRF_POWER_RAMPOWER_S13RETENTION_MASK = 1UL << NRF_POWER_RAMPOWER_S13RETENTION,
    NRF_POWER_RAMPOWER_S14RETENTION_MASK = 1UL << NRF_POWER_RAMPOWER_S14RETENTION,
    NRF_POWER_RAMPOWER_S15RETENTION_MASK = 1UL << NRF_POWER_RAMPOWER_S15RETENTION,
} nrf_power_rampower_mask_t;
#if defined ( __CC_ARM )
#pragma pop
#endif
#endif /* NRF_POWER_HAS_RAMPOWER_REGS */


/**
    @brief Get reset reason mask

    Function returns the reset reason.
    Unless cleared, the RESETREAS register is cumulative.
    A field is cleared by writing '1' to it (see @ref nrf_power_resetreas_clear).
    If none of the reset sources are flagged,
    this indicates that the chip was reset from the on-chip reset generator,
    which indicates a power-on-reset or a brown out reset.

    @return The mask of reset reasons constructed with @ref nrf_power_resetreas_mask_t.
*/
__STATIC_INLINE uint32_t nrf_power_resetreas_get(void);

/**
    @brief Clear selected reset reason field

    Function clears selected reset reason fields.

    @param[in] mask The mask constructed from @ref nrf_power_resetreas_mask_t enumerator values.
    @sa nrf_power_resetreas_get
*/
__STATIC_INLINE void nrf_power_resetreas_clear(uint32_t mask);

#if NRF_POWER_HAS_RAMSTATUS
/**
    @brief Get RAMSTATUS register

    Returns the masks of RAM blocks that are powered ON.

    @return Value with bits sets according to masks in @ref nrf_power_ramblock_mask_t.
*/
__STATIC_INLINE uint32_t nrf_power_ramstatus_get(void);
#endif // NRF_POWER_HAS_RAMSTATUS

/**
    @brief Go to system OFF

    This function puts the CPU into system off mode.
    The only way to wake up the CPU is by reset.

    @note This function never returns.
*/
__STATIC_INLINE void nrf_power_system_off(void);

/**
    @brief Set power failure comparator configuration

    Sets power failure comparator threshold and enable/disable flag.

    @param enabled Set to true if power failure comparator should be enabled.
    @param thr     Set the voltage threshold value.

    @note
    If VDDH settings is present in the device, this function would
    clear it settings (set to the lowest voltage).
    Use @ref nrf_power_pofcon_vddh_set function to set new value.
*/
__STATIC_INLINE void nrf_power_pofcon_set(bool enabled, nrf_power_pof_thr_t thr);

/**
    @brief Get power failure comparator configuration

    Get power failure comparator threshold and enable bit.

    @param[out] p_enabled Function would set this boolean variable to true
                         if power failure comparator is enabled.
                         The pointer can be NULL if we do not need this information.
    @return Threshold setting for power failure comparator
*/
__STATIC_INLINE nrf_power_pof_thr_t nrf_power_pofcon_get(bool *p_enabled);

#if NRF_POWER_HAS_VDDH
/**
    @brief Set VDDH power failure comparator threshold

    @param thr Threshold to be set
*/
__STATIC_INLINE void nrf_power_pofcon_vddh_set(nrf_power_pof_thrvddh_t thr);

/**
    @brief Get VDDH power failure comparator threshold

    @return VDDH threshold currently configured
*/
__STATIC_INLINE nrf_power_pof_thrvddh_t nrf_power_pofcon_vddh_get(void);
#endif

/**
    @brief Set general purpose retention register

    @param val Value to be set in the register
*/
__STATIC_INLINE void nrf_power_gpregret_set(uint8_t val);

/**
    @brief Get general purpose retention register

    @return The value from the register
*/
__STATIC_INLINE uint8_t nrf_power_gpregret_get(void);

#if defined(POWER_GPREGRET2_GPREGRET_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Set general purpose retention register 2

    @param val Value to be set in the register
    @note This register is not available in nrf51 MCU family
*/
__STATIC_INLINE void nrf_power_gpregret2_set(uint8_t val);

/**
    @brief Get general purpose retention register 2

    @return The value from the register
    @note This register is not available in all MCUs.
*/
__STATIC_INLINE uint8_t nrf_power_gpregret2_get(void);
#endif

/**
    @brief Enable or disable DCDC converter

