hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_power.h
    @param enable Set true to enable or false to disable DCDC converter.

    @note
    If the device consist of high voltage power input (VDDH) this setting
    would relate to the converter on low voltage side (1.3&nbsp;V output).
*/
__STATIC_INLINE void nrf_power_dcdcen_set(bool enable);

/**
    @brief Get the state of DCDC converter

    @retval true  Converter is enabled
    @retval false Converter is disabled

    @note
    If the device consist of high voltage power input (VDDH) this setting
    would relate to the converter on low voltage side (1.3&nbsp;V output).
*/
__STATIC_INLINE bool nrf_power_dcdcen_get(void);

#if NRF_POWER_HAS_RAMPOWER_REGS
/**
    @brief Turn ON sections in selected RAM block.

    This function turns ON sections in block and also block retention.

    @sa nrf_power_rampower_mask_t
    @sa nrf_power_rampower_mask_off

    @param block        RAM block index.
    @param section_mask Mask of the sections created by merging
                       @ref nrf_power_rampower_mask_t flags.
*/
__STATIC_INLINE void nrf_power_rampower_mask_on(uint8_t block, uint32_t section_mask);

/**
    @brief Turn ON sections in selected RAM block.

    This function turns OFF sections in block and also block retention.

    @sa nrf_power_rampower_mask_t
    @sa nrf_power_rampower_mask_off

    @param block        RAM block index.
    @param section_mask Mask of the sections created by merging
                       @ref nrf_power_rampower_mask_t flags.
*/
__STATIC_INLINE void nrf_power_rampower_mask_off(uint8_t block, uint32_t section_mask);

/**
    @brief Get the mask of ON and retention sections in selected RAM block.

    @param block RAM block index.
    @return Mask of sections state composed from @ref nrf_power_rampower_mask_t flags.
*/
__STATIC_INLINE uint32_t nrf_power_rampower_mask_get(uint8_t block);
#endif /* NRF_POWER_HAS_RAMPOWER_REGS */

#if NRF_POWER_HAS_VDDH
/**
    @brief Enable of disable DCDC converter on VDDH

    @param enable Set true to enable or false to disable DCDC converter.
*/
__STATIC_INLINE void nrf_power_dcdcen_vddh_set(bool enable);

/**
    @brief Get the state of DCDC converter on VDDH

    @retval true  Converter is enabled
    @retval false Converter is disabled
*/
__STATIC_INLINE bool nrf_power_dcdcen_vddh_get(void);

/**
    @brief Get main supply status

    @return Current main supply status
*/
__STATIC_INLINE nrf_power_mainregstatus_t nrf_power_mainregstatus_get(void);
#endif /* NRF_POWER_HAS_VDDH */

#if NRF_POWER_HAS_USBREG
/**

    @return Get the whole USBREGSTATUS register

    @return The USBREGSTATUS register value.
           Use @ref nrf_power_usbregstatus_mask_t values for bit masking.

    @sa nrf_power_usbregstatus_vbusdet_get
    @sa nrf_power_usbregstatus_outrdy_get
*/
__STATIC_INLINE uint32_t nrf_power_usbregstatus_get(void);

/**
    @brief VBUS input detection status

    USBDETECTED and USBREMOVED events are derived from this information

    @retval false VBUS voltage below valid threshold
    @retval true  VBUS voltage above valid threshold

    @sa nrf_power_usbregstatus_get
*/
__STATIC_INLINE bool nrf_power_usbregstatus_vbusdet_get(void);

/**
    @brief USB supply output settling time elapsed

    @retval false USBREG output settling time not elapsed
    @retval true  USBREG output settling time elapsed
                 (same information as USBPWRRDY event)

    @sa nrf_power_usbregstatus_get
*/
__STATIC_INLINE bool nrf_power_usbregstatus_outrdy_get(void);
#endif /* NRF_POWER_HAS_USBREG */

#ifndef SUPPRESS_INLINE_IMPLEMENTATION

__STATIC_INLINE uint32_t nrf_power_resetreas_get(void)
{
    return NRF_POWER->RESETREAS;
}

__STATIC_INLINE void nrf_power_resetreas_clear(uint32_t mask)
{
    NRF_POWER->RESETREAS = mask;
}

#if NRF_POWER_HAS_RAMSTATUS
__STATIC_INLINE uint32_t nrf_power_ramstatus_get(void)
{
    return NRF_POWER->RAMSTATUS;
}
#endif // NRF_POWER_HAS_RAMSTATUS

__STATIC_INLINE void nrf_power_system_off(void)
{
    NRF_POWER->SYSTEMOFF = POWER_SYSTEMOFF_SYSTEMOFF_Enter;
    __DSB();
    
    /* Solution for simulated System OFF in debug mode */
    while(true)
        __WFE();
}

__STATIC_INLINE void nrf_power_pofcon_set(bool enabled, nrf_power_pof_thr_t thr)
{
    NRFX_ASSERT(thr == (thr & (POWER_POFCON_THRESHOLD_Msk >> POWER_POFCON_THRESHOLD_Pos)));
    #if NRF_POWER_HAS_VDDH
    uint32_t pofcon = NRF_POWER->POFCON;
    pofcon &= ~(POWER_POFCON_THRESHOLD_Msk | POWER_POFCON_POF_Msk);
    pofcon |=
    #else /* NRF_POWER_HAS_VDDH */
    NRF_POWER->POFCON =
    #endif
        (((uint32_t)thr) << POWER_POFCON_THRESHOLD_Pos) |
        (enabled ?
         (POWER_POFCON_POF_Enabled << POWER_POFCON_POF_Pos)
         :
         (POWER_POFCON_POF_Disabled << POWER_POFCON_POF_Pos));
    #if NRF_POWER_HAS_VDDH
    NRF_POWER->POFCON = pofcon;
    #endif
}

__STATIC_INLINE nrf_power_pof_thr_t nrf_power_pofcon_get(bool *p_enabled)
{
    uint32_t pofcon = NRF_POWER->POFCON;
    
    if(NULL != p_enabled)
    {
        (*p_enabled) = ((pofcon & POWER_POFCON_POF_Msk) >> POWER_POFCON_POF_Pos)
                       == POWER_POFCON_POF_Enabled;
    }
    
    return (nrf_power_pof_thr_t)((pofcon & POWER_POFCON_THRESHOLD_Msk) >>
                                 POWER_POFCON_THRESHOLD_Pos);
}

#if NRF_POWER_HAS_VDDH
__STATIC_INLINE void nrf_power_pofcon_vddh_set(nrf_power_pof_thrvddh_t thr)
{
    NRFX_ASSERT(thr == (thr & (POWER_POFCON_THRESHOLDVDDH_Msk >> POWER_POFCON_THRESHOLDVDDH_Pos)));
    uint32_t pofcon = NRF_POWER->POFCON;
    pofcon &= ~POWER_POFCON_THRESHOLDVDDH_Msk;
    pofcon |= (((uint32_t)thr) << POWER_POFCON_THRESHOLDVDDH_Pos);
    NRF_POWER->POFCON = pofcon;
}

__STATIC_INLINE nrf_power_pof_thrvddh_t nrf_power_pofcon_vddh_get(void)
{
    return (nrf_power_pof_thrvddh_t)((NRF_POWER->POFCON &
                                      POWER_POFCON_THRESHOLDVDDH_Msk) >> POWER_POFCON_THRESHOLDVDDH_Pos);
}
#endif /* NRF_POWER_HAS_VDDH */

__STATIC_INLINE void nrf_power_gpregret_set(uint8_t val)
{
    NRF_POWER->GPREGRET = val;
}

__STATIC_INLINE uint8_t nrf_power_gpregret_get(void)
{
    return NRF_POWER->GPREGRET;
}

#if defined(POWER_GPREGRET2_GPREGRET_Msk) || defined(__NRFX_DOXYGEN__)
void nrf_power_gpregret2_set(uint8_t val)
{
    NRF_POWER->GPREGRET2 = val;
}

